tutorials/incompressibleVoF/damBreak3D/0/k
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [turbulentKineticEnergy];

internalField   uniform 0.00015;

boundaryField
{
    atmosphere
    {
        type            inletOutlet;
        inletValue      $internalField;
    }
    walls
    {
        type            kqRWallFunction;
        value           $internalField;
    }
}


// ************************************************************************* //
